bezier_coanda3d/system/blockMeshDict
/*---------------------------------*- C++ -*-----------------------------------*/
//    //////////////      ///////////////
//    //////////////      //////////////
//         ////           ////             /////       ////  //  /// //// ////
//         ////     ////  ///////////   ///    ///  ///    ///   ////  ///  ///
//  ////   ////           ///////////   ///    ///  ///    ///   ///   ///  ///
//   //// ////            ////          ///    ///  ///    ///   ///   ///  ///
//     /////              ////            /////       ///// ///  ///   ///  ///
/*---------------------------------*- C++ -*-----------------------------------*/

FoamFile
{
		version			2.0;
		format			ascii;
		class				dictionary;
		object			blockMeshDict;
}

// ***************************************************************************** //

scale				1;

vertices
(
		(-4.8 0.0 -0.078)	//	0
		(-4.8 0.0 0.078)	//	1
		(-0.03114733564114338 -4.8 -0.078)	//	2
		(-0.03114733564114338 -4.8 0.078)	//	3
		(-0.3 0.0 -0.078)	//	4
		(-0.3 0.0 0.078)	//	5
		(-0.03152531784432404 0.0038404832321552174 -0.078)	//	6
		(-0.03152531784432404 0.0038404832321552174 0.078)	//	7
		(-0.03152531784432404 4.8 -0.078)	//	8
		(-0.03152531784432404 4.8 0.078)	//	9
		(-0.003045 4.8 -0.078)	//	10
		(-0.003045 4.8 0.078)	//	11
		(4.796952 0.0 -0.078)	//	12
		(4.796952 0.0 0.078)	//	13
		(-0.003045 -4.8 -0.078)	//	14
		(-0.003045 -4.8 0.078)	//	15
		(0.0 0.0 -0.078)	//	16
		(0.0 0.0 0.078)	//	17
		(-0.03114733564114338 -0.0038639135055789967 -0.078)	//	18
		(-0.03114733564114338 -0.0038639135055789967 0.078)	//	19
		(0.0 0.0 -0.078)	//	20
		(0.0 0.0 0.078)	//	21
		(-0.003048 0.003048 -0.078)	//	22
		(-0.003048 0.003048 0.078)	//	23
		(-0.003047 0.0032765999999999997 -0.078)	//	24
		(-0.003047 0.0032765999999999997 0.078)	//	25
		(-0.003046 0.0035813999999999998 -0.078)	//	26
		(-0.003046 0.0035813999999999998 0.078)	//	27
		(-0.03152531784432404 0.0038404832321552174 -0.078)	//	28
		(-0.03152531784432404 0.0038404832321552174 0.078)	//	29
		(-0.003048 -0.003048 -0.078)	//	30
		(-0.003048 -0.003048 0.078)	//	31
		(-0.003047 -0.0032765999999999997 -0.078)	//	32
		(-0.003047 -0.0032765999999999997 0.078)	//	33
		(-0.003046 -0.0035813999999999998 -0.078)	//	34
		(-0.003046 -0.0035813999999999998 0.078)	//	35
		(-0.03114733564114338 -0.0038639135055789967 -0.078)	//	36
		(-0.03114733564114338 -0.0038639135055789967 0.078)	//	37
);

blocks
(
		hex ( 4 28  8  0  5 29  9  1) (50 50 40) edgeGrading (((.5 .5 10) (.5 .5 0.1)) 0.1  0.1 ((.5 .5 10) (.5 .5 0.1)) 800 800 800 800 1 1 1 1) // 0
		hex (28 26 10  8 29 27 11  9) (15 50 40) simpleGrading (0.5  800  1) // 1
		hex (26 34 14 10 27 35 15 11) (60 50 40) simpleGrading ( 1  800  1) // 2
		hex (34 36  2 14 35 37  3 15) (15 50 40) simpleGrading (2  800  1) // 3
		hex (36  4  0  2 37  5  1  3) (50 50 40) edgeGrading (((.5 .5 10) (.5 .5 0.1)) 10  10 ((.5 .5 10) (.5 .5 0.1)) 800 800 800 800 1 1 1 1) // 4
		hex (24 32 34 26 25 33 35 27) (60 1 40) simpleGrading ( 1  2  1) // 5
		hex (22 30 32 24 23 31 33 25) (60 2 40) simpleGrading ( 1  2  1) // 6
);

edges
(
		arc  8  0  90.0  (0 0 1)
		arc  9  1  90.0  (0 0 1)
		arc  0  2  90.0  (0 0 1)
		arc  1  3  90.0  (0 0 1)
		arc 14 10 180.0  (0 0 1)
		arc 15 11 180.0  (0 0 1)
		arc 30 22 180.0  (0 0 1)
		arc 31 23 180.0  (0 0 1)
		arc 32 24 180.0  (0 0 1)
		arc 33 25 180.0  (0 0 1)
		arc 34 26 180.0  (0 0 1)
		arc 35 27 180.0  (0 0 1)
		spline 4 28 (
							(-0.29988501  0.0010732  -0.078     )
							(-0.29954978  0.00209611 -0.078     )
							(-0.29900841  0.00307069 -0.078     )
							(-0.2982744   0.00399884 -0.078     )
							(-0.29736059  0.0048824  -0.078     )
							(-0.29627925  0.00572315 -0.078     )
							(-0.29504205  0.00652281 -0.078     )
							(-0.29366009  0.00728305 -0.078     )
							(-0.29214393  0.00800547 -0.078     )
							(-0.29050357  0.00869161 -0.078     )
							(-0.28874848  0.00934297 -0.078     )
							(-0.28688765  0.00996098 -0.078     )
							(-0.28492954  0.01054702 -0.078     )
							(-0.28288215  0.0111024  -0.078     )
							(-0.280753   0.0116284 -0.078    )
							(-0.27854916  0.01212624 -0.078     )
							(-0.27627727  0.01259707 -0.078     )
							(-0.27394353  0.013042   -0.078     )
							(-0.27155373  0.0134621  -0.078     )
							(-0.26911327  0.01385838 -0.078     )
							(-0.26662717  0.01423179 -0.078     )
							(-0.26410005  0.01458325 -0.078     )
							(-0.2615362   0.01491363 -0.078     )
							(-0.25893954  0.01522373 -0.078     )
							(-0.25631369  0.01551434 -0.078     )
							(-0.25366191  0.01578618 -0.078     )
							(-0.25098718  0.01603994 -0.078     )
							(-0.24829216  0.01627625 -0.078     )
							(-0.24557924  0.01649572 -0.078     )
							(-0.24285054  0.0166989  -0.078     )
							(-0.24010791  0.01688632 -0.078     )
							(-0.23735296  0.01705846 -0.078     )
							(-0.23458704  0.01721576 -0.078     )
							(-0.2318113   0.01735863 -0.078     )
							(-0.22902665  0.01748743 -0.078     )
							(-0.22623382  0.01760252 -0.078     )
							(-0.22343332  0.01770419 -0.078     )
							(-0.2206255   0.01779271 -0.078     )
							(-0.21781052  0.01786834 -0.078     )
							(-0.21498837  0.01793127 -0.078     )
							(-0.21215892  0.01798171 -0.078     )
							(-0.20932186  0.01801981 -0.078     )
							(-0.20647676  0.01804569 -0.078     )
							(-0.20362307  0.01805948 -0.078     )
							(-0.20076013  0.01806126 -0.078     )
							(-0.19788716  0.01805108 -0.078     )
							(-0.19500329  0.01802901 -0.078     )
							(-0.19210756  0.01799505 -0.078     )
							(-0.18919895  0.01794922 -0.078     )
							(-0.18627634  0.01789152 -0.078     )
							(-0.18333857  0.01782192 -0.078     )
							(-0.18038443  0.01774038 -0.078     )
							(-0.17741264  0.01764685 -0.078     )
							(-0.17442191  0.01754129 -0.078     )
							(-0.1714109   0.01742362 -0.078     )
							(-0.16837827  0.01729377 -0.078     )
							(-0.16532265  0.01715166 -0.078     )
							(-0.16224266  0.01699721 -0.078     )
							(-0.15913693  0.01683033 -0.078     )
							(-0.1560041   0.01665093 -0.078     )
							(-0.15284282  0.01645894 -0.078     )
							(-0.14965176  0.01625426 -0.078     )
							(-0.14642961  0.01603682 -0.078     )
							(-0.14317511  0.01580654 -0.078     )
							(-0.13988702  0.01556336 -0.078     )
							(-0.13656418  0.01530722 -0.078     )
							(-0.13320543  0.01503807 -0.078     )
							(-0.12980972  0.01475588 -0.078     )
							(-0.12637603  0.01446063 -0.078     )
							(-0.12290342  0.01415232 -0.078     )
							(-0.11939103  0.01383096 -0.078     )
							(-0.11583806  0.01349658 -0.078     )
							(-0.1122438   0.01314925 -0.078     )
							(-0.10860766  0.01278903 -0.078     )
							(-0.10492909  0.01241605 -0.078     )
							(-0.10120767  0.01203042 -0.078     )
							(-0.09744308  0.0116323  -0.078     )
							(-0.09363511  0.0112219  -0.078     )
							(-0.08978363  0.01079944 -0.078     )
							(-0.08588867  0.01036517 -0.078     )
							(-0.08195033  0.0099194  -0.078     )
							(-0.07796886  0.00946245 -0.078     )
							(-0.07394463  0.00899472 -0.078     )
							(-0.06987813  0.00851662 -0.078     )
							(-0.06576998  0.00802861 -0.078     )
							(-0.06162095  0.00753121 -0.078     )
							(-0.05743191  0.00702498 -0.078     )
							(-0.05320391  0.00651053 -0.078     )
							(-0.04893811  0.00598854 -0.078     )
							(-0.04463582  0.00545973 -0.078     )
							(-0.0402985   0.00492488 -0.078     )
							(-0.03592775  0.00438483 -0.078     )

						)
		spline 4 36 (
							(-0.2998944  -0.00105998 -0.078     )
							(-0.29958648 -0.00207057 -0.078     )
							(-0.29908908 -0.00303374 -0.078     )
							(-0.29841444 -0.00395134 -0.078     )
							(-0.29757423 -0.0048252  -0.078     )
							(-0.29657952 -0.00565707 -0.078     )
							(-0.29544087 -0.00644866 -0.078     )
							(-0.29416825 -0.0072016  -0.078     )
							(-0.29277115 -0.00791748 -0.078     )
							(-0.29125852 -0.00859781 -0.078     )
							(-0.28963884 -0.00924406 -0.078     )
							(-0.28792009 -0.00985764 -0.078     )
							(-0.28610979 -0.0104399  -0.078     )
							(-0.28421503 -0.01099215 -0.078     )
							(-0.28224243 -0.01151563 -0.078     )
							(-0.28019821 -0.01201153 -0.078     )
							(-0.27808817 -0.01248099 -0.078     )
							(-0.27591773 -0.01292509 -0.078     )
							(-0.2736919  -0.01334487 -0.078     )
							(-0.27141535 -0.01374133 -0.078     )
							(-0.26909238 -0.01411539 -0.078     )
							(-0.26672696 -0.01446794 -0.078     )
							(-0.26432271 -0.01479983 -0.078     )
							(-0.26188295 -0.01511186 -0.078     )
							(-0.25941068 -0.01540476 -0.078     )
							(-0.25690864 -0.01567926 -0.078     )
							(-0.25437924 -0.015936   -0.078     )
							(-0.25182467 -0.01617561 -0.078     )
							(-0.24924684 -0.01639867 -0.078     )
							(-0.24664742 -0.01660571 -0.078     )
							(-0.24402784 -0.01679723 -0.078     )
							(-0.24138933 -0.01697369 -0.078     )
							(-0.23873288 -0.01713552 -0.078     )
							(-0.2360593  -0.01728309 -0.078     )
							(-0.2333692  -0.01741677 -0.078     )
							(-0.23066304 -0.01753686 -0.078     )
							(-0.22794108 -0.01764367 -0.078     )
							(-0.22520343 -0.01773742 -0.078     )
							(-0.22245007 -0.01781837 -0.078     )
							(-0.21968083 -0.01788668 -0.078     )
							(-0.21689542 -0.01794254 -0.078     )
							(-0.21409341 -0.01798609 -0.078     )
							(-0.2112743  -0.01801743 -0.078     )
							(-0.20843748 -0.01803667 -0.078     )
							(-0.20558222 -0.01804386 -0.078     )
							(-0.20270776 -0.01803907 -0.078     )
							(-0.19981322 -0.01802231 -0.078     )
							(-0.19689771 -0.01799359 -0.078     )
							(-0.19396024 -0.01795292 -0.078     )
							(-0.19099981 -0.01790026 -0.078     )
							(-0.18801535 -0.01783559 -0.078     )
							(-0.1850058  -0.01775884 -0.078     )
							(-0.18197003 -0.01766996 -0.078     )
							(-0.17890696 -0.01756889 -0.078     )
							(-0.17581544 -0.01745553 -0.078     )
							(-0.17269437 -0.01732981 -0.078     )
							(-0.16954264 -0.01719164 -0.078     )
							(-0.16635915 -0.01704092 -0.078     )
							(-0.16314284 -0.01687757 -0.078     )
							(-0.15989267 -0.01670147 -0.078     )
							(-0.15660765 -0.01651254 -0.078     )
							(-0.1532868 -0.0163107 -0.078    )
							(-0.14992923 -0.01609584 -0.078     )
							(-0.14653408 -0.01586789 -0.078     )
							(-0.14310056 -0.01562679 -0.078     )
							(-0.13962796 -0.01537246 -0.078     )
							(-0.13611562 -0.01510487 -0.078     )
							(-0.13256297 -0.01482396 -0.078     )
							(-0.12896952 -0.01452973 -0.078     )
							(-0.12533489 -0.01422216 -0.078     )
							(-0.12165876 -0.01390127 -0.078     )
							(-0.11794093 -0.01356709 -0.078     )
							(-0.11418131 -0.01321968 -0.078     )
							(-0.1103799  -0.01285913 -0.078     )
							(-0.10653683 -0.01248554 -0.078     )
							(-0.10265233 -0.01209905 -0.078     )
							(-0.09872675 -0.01169982 -0.078     )
							(-0.0947606  -0.01128806 -0.078     )
							(-0.09075447 -0.01086399 -0.078     )
							(-0.08670911 -0.01042788 -0.078     )
							(-0.08262541 -0.00998005 -0.078     )
							(-0.07850437 -0.00952083 -0.078     )
							(-0.07434716 -0.00905062 -0.078     )
							(-0.07015509 -0.00856985 -0.078     )
							(-0.0659296 -0.008079  -0.078    )
							(-0.0616723 -0.0075786 -0.078    )
							(-0.05738493 -0.00706922 -0.078     )
							(-0.05306941 -0.00655151 -0.078     )
							(-0.04872781 -0.00602614 -0.078     )
							(-0.04436233 -0.00549386 -0.078     )
							(-0.03997537 -0.00495548 -0.078     )
							(-0.03556947 -0.00441185 -0.078     )

						)
		spline 5 29 (
							(-0.29988501  0.0010732   0.078     )
							(-0.29954978  0.00209611  0.078     )
							(-0.29900841  0.00307069  0.078     )
							(-0.2982744   0.00399884  0.078     )
							(-0.29736059  0.0048824   0.078     )
							(-0.29627925  0.00572315  0.078     )
							(-0.29504205  0.00652281  0.078     )
							(-0.29366009  0.00728305  0.078     )
							(-0.29214393  0.00800547  0.078     )
							(-0.29050357  0.00869161  0.078     )
							(-0.28874848  0.00934297  0.078     )
							(-0.28688765  0.00996098  0.078     )
							(-0.28492954  0.01054702  0.078     )
							(-0.28288215  0.0111024   0.078     )
							(-0.280753   0.0116284  0.078    )
							(-0.27854916  0.01212624  0.078     )
							(-0.27627727  0.01259707  0.078     )
							(-0.27394353  0.013042    0.078     )
							(-0.27155373  0.0134621   0.078     )
							(-0.26911327  0.01385838  0.078     )
							(-0.26662717  0.01423179  0.078     )
							(-0.26410005  0.01458325  0.078     )
							(-0.2615362   0.01491363  0.078     )
							(-0.25893954  0.01522373  0.078     )
							(-0.25631369  0.01551434  0.078     )
							(-0.25366191  0.01578618  0.078     )
							(-0.25098718  0.01603994  0.078     )
							(-0.24829216  0.01627625  0.078     )
							(-0.24557924  0.01649572  0.078     )
							(-0.24285054  0.0166989   0.078     )
							(-0.24010791  0.01688632  0.078     )
							(-0.23735296  0.01705846  0.078     )
							(-0.23458704  0.01721576  0.078     )
							(-0.2318113   0.01735863  0.078     )
							(-0.22902665  0.01748743  0.078     )
							(-0.22623382  0.01760252  0.078     )
							(-0.22343332  0.01770419  0.078     )
							(-0.2206255   0.01779271  0.078     )
							(-0.21781052  0.01786834  0.078     )
							(-0.21498837  0.01793127  0.078     )
							(-0.21215892  0.01798171  0.078     )
							(-0.20932186  0.01801981  0.078     )
							(-0.20647676  0.01804569  0.078     )
							(-0.20362307  0.01805948  0.078     )
							(-0.20076013  0.01806126  0.078     )
							(-0.19788716  0.01805108  0.078     )
							(-0.19500329  0.01802901  0.078     )
							(-0.19210756  0.01799505  0.078     )
							(-0.18919895  0.01794922  0.078     )
							(-0.18627634  0.01789152  0.078     )
							(-0.18333857  0.01782192  0.078     )
							(-0.18038443  0.01774038  0.078     )
							(-0.17741264  0.01764685  0.078     )
							(-0.17442191  0.01754129  0.078     )
							(-0.1714109   0.01742362  0.078     )
							(-0.16837827  0.01729377  0.078     )
							(-0.16532265  0.01715166  0.078     )
							(-0.16224266  0.01699721  0.078     )
							(-0.15913693  0.01683033  0.078     )
							(-0.1560041   0.01665093  0.078     )
							(-0.15284282  0.01645894  0.078     )
							(-0.14965176  0.01625426  0.078     )
							(-0.14642961  0.01603682  0.078     )
							(-0.14317511  0.01580654  0.078     )
							(-0.13988702  0.01556336  0.078     )
							(-0.13656418  0.01530722  0.078     )
							(-0.13320543  0.01503807  0.078     )
							(-0.12980972  0.01475588  0.078     )
							(-0.12637603  0.01446063  0.078     )
							(-0.12290342  0.01415232  0.078     )
							(-0.11939103  0.01383096  0.078     )
							(-0.11583806  0.01349658  0.078     )
							(-0.1122438   0.01314925  0.078     )
							(-0.10860766  0.01278903  0.078     )
							(-0.10492909  0.01241605  0.078     )
							(-0.10120767  0.01203042  0.078     )
							(-0.09744308  0.0116323   0.078     )
							(-0.09363511  0.0112219   0.078     )
							(-0.08978363  0.01079944  0.078     )
							(-0.08588867  0.01036517  0.078     )
							(-0.08195033  0.0099194   0.078     )
							(-0.07796886  0.00946245  0.078     )
							(-0.07394463  0.00899472  0.078     )
							(-0.06987813  0.00851662  0.078     )
							(-0.06576998  0.00802861  0.078     )
							(-0.06162095  0.00753121  0.078     )
							(-0.05743191  0.00702498  0.078     )
							(-0.05320391  0.00651053  0.078     )
							(-0.04893811  0.00598854  0.078     )
							(-0.04463582  0.00545973  0.078     )
							(-0.0402985   0.00492488  0.078     )
							(-0.03592775  0.00438483  0.078     )

						)
		spline 5 37 (
							(-0.2998944  -0.00105998  0.078     )
							(-0.29958648 -0.00207057  0.078     )
							(-0.29908908 -0.00303374  0.078     )
							(-0.29841444 -0.00395134  0.078     )
							(-0.29757423 -0.0048252   0.078     )
							(-0.29657952 -0.00565707  0.078     )
							(-0.29544087 -0.00644866  0.078     )
							(-0.29416825 -0.0072016   0.078     )
							(-0.29277115 -0.00791748  0.078     )
							(-0.29125852 -0.00859781  0.078     )
							(-0.28963884 -0.00924406  0.078     )
							(-0.28792009 -0.00985764  0.078     )
							(-0.28610979 -0.0104399   0.078     )
							(-0.28421503 -0.01099215  0.078     )
							(-0.28224243 -0.01151563  0.078     )
							(-0.28019821 -0.01201153  0.078     )
							(-0.27808817 -0.01248099  0.078     )
							(-0.27591773 -0.01292509  0.078     )
							(-0.2736919  -0.01334487  0.078     )
							(-0.27141535 -0.01374133  0.078     )
							(-0.26909238 -0.01411539  0.078     )
							(-0.26672696 -0.01446794  0.078     )
							(-0.26432271 -0.01479983  0.078     )
							(-0.26188295 -0.01511186  0.078     )
							(-0.25941068 -0.01540476  0.078     )
							(-0.25690864 -0.01567926  0.078     )
							(-0.25437924 -0.015936    0.078     )
							(-0.25182467 -0.01617561  0.078     )
							(-0.24924684 -0.01639867  0.078     )
							(-0.24664742 -0.01660571  0.078     )
							(-0.24402784 -0.01679723  0.078     )
							(-0.24138933 -0.01697369  0.078     )
							(-0.23873288 -0.01713552  0.078     )
							(-0.2360593  -0.01728309  0.078     )
							(-0.2333692  -0.01741677  0.078     )
							(-0.23066304 -0.01753686  0.078     )
							(-0.22794108 -0.01764367  0.078     )
							(-0.22520343 -0.01773742  0.078     )
							(-0.22245007 -0.01781837  0.078     )
							(-0.21968083 -0.01788668  0.078     )
							(-0.21689542 -0.01794254  0.078     )
							(-0.21409341 -0.01798609  0.078     )
							(-0.2112743  -0.01801743  0.078     )
							(-0.20843748 -0.01803667  0.078     )
							(-0.20558222 -0.01804386  0.078     )
							(-0.20270776 -0.01803907  0.078     )
							(-0.19981322 -0.01802231  0.078     )
							(-0.19689771 -0.01799359  0.078     )
							(-0.19396024 -0.01795292  0.078     )
							(-0.19099981 -0.01790026  0.078     )
							(-0.18801535 -0.01783559  0.078     )
							(-0.1850058  -0.01775884  0.078     )
							(-0.18197003 -0.01766996  0.078     )
							(-0.17890696 -0.01756889  0.078     )
							(-0.17581544 -0.01745553  0.078     )
							(-0.17269437 -0.01732981  0.078     )
							(-0.16954264 -0.01719164  0.078     )
							(-0.16635915 -0.01704092  0.078     )
							(-0.16314284 -0.01687757  0.078     )
							(-0.15989267 -0.01670147  0.078     )
							(-0.15660765 -0.01651254  0.078     )
							(-0.1532868 -0.0163107  0.078    )
							(-0.14992923 -0.01609584  0.078     )
							(-0.14653408 -0.01586789  0.078     )
							(-0.14310056 -0.01562679  0.078     )
							(-0.13962796 -0.01537246  0.078     )
							(-0.13611562 -0.01510487  0.078     )
							(-0.13256297 -0.01482396  0.078     )
							(-0.12896952 -0.01452973  0.078     )
							(-0.12533489 -0.01422216  0.078     )
							(-0.12165876 -0.01390127  0.078     )
							(-0.11794093 -0.01356709  0.078     )
							(-0.11418131 -0.01321968  0.078     )
							(-0.1103799  -0.01285913  0.078     )
							(-0.10653683 -0.01248554  0.078     )
							(-0.10265233 -0.01209905  0.078     )
							(-0.09872675 -0.01169982  0.078     )
							(-0.0947606  -0.01128806  0.078     )
							(-0.09075447 -0.01086399  0.078     )
							(-0.08670911 -0.01042788  0.078     )
							(-0.08262541 -0.00998005  0.078     )
							(-0.07850437 -0.00952083  0.078     )
							(-0.07434716 -0.00905062  0.078     )
							(-0.07015509 -0.00856985  0.078     )
							(-0.0659296 -0.008079   0.078    )
							(-0.0616723 -0.0075786  0.078    )
							(-0.05738493 -0.00706922  0.078     )
							(-0.05306941 -0.00655151  0.078     )
							(-0.04872781 -0.00602614  0.078     )
							(-0.04436233 -0.00549386  0.078     )
							(-0.03997537 -0.00495548  0.078     )
							(-0.03556947 -0.00441185  0.078     )

						)
);

boundary
(
    inOut
    {
        type patch;
        faces
        (
            ( 8  0  1  9)
            ( 0  2  3  1)
            (14 10 11 15)
            ( 2 14 15  3)
            (10  8  9 11)
            ( 0  4 28  8) // Begin Z-Flow
            ( 1  5 29  9)
            (28 26 10  8)
            (29 27 11  9)
            (10 14 26 34)
            (11 15 27 35)
            (14  2 36 34)
            (15  3 37 35)
            ( 2  0  4 36)
            ( 3  1  5 37)
            (26 34 32 24)
            (27 35 33 25)
            (24 32 30 22)
            (25 33 31 23)
        );
    }

    coandaUpper
    {
        type patch;
        faces
        (
            (24 22 23 25)
        );
    }

    coandaLower
    {
        type patch;
        faces
        (
            (30 32 33 31)
        );
    }

    surface
    {
        type wall;
        faces
        (
            ( 4 28 29  5)
            ( 4 36 37  5)
            (28 26 27 29)
            (26 24 25 27)
            (22 30 31 23)
            (32 34 35 33)
            (34 36 37 35)
        );
    }


);
