bezier_coanda3d/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          298;
Tcoanda         298;
dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;


boundaryField
{
		inOut
		{
				type		inletOutlet;
				inletValue			uniform $Tinlet;
				value			$inletValue;
		}
		surface
		{
				type		zeroGradient;
		}
		coandaLower
		{
				type		zeroGradient;
		}
		coandaUpper
		{
				type		inletOutlet;
        inletValue uniform $Tcoanda;
				value		uniform $Tcoanda;
		}
		defaultFaces
		{
				type			empty;
		}
		#includeEtc "caseDicts/setConstraintTypes"
}
