bezier_coanda3d/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|p_rgh|G)"
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    "(U|T|e|h|nuTilda|k|omega|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0.1;
    }

}

SIMPLE
{
    nNonOrthogonalCorrectors 1;

    residualControl
    {
        p               2.5e-5;
        U               2.5e-5;
        nuTilda         2.7e-5;
    }
}

relaxationFactors
{
    fields
    {
        "(p|p_rgh|rho)"                     0.30;
    }
    equations
    {
        "(U|T|e|h|nuTilda|k|epsilon|omega)" 0.70;
    }

}

potentialFlow
{
    nNonOrthogonalCorrectors           20;
}


// ************************************************************************* //
